app/controllers/booking_controller.rb

	def create
   		prop = Property.find(params[:prop_id])
	   	@booking = current_user.bookings.build(:b_cin => params[:booking][:b_cin], :b_cout=> params[:booking][:b_cout],:property_id=> prop[:id])
	    if @booking.save
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 6)
INSERT INTO `bookings` (`b_place`, `b_cin`, `b_cout`, `created_at`, `updated_at`, `property_id`, `user_id`) VALUES('IN', NULL, NULL, '2014-02-05 06:44:33', '2014-02-05 06:44:33', 37, 2)