app/controllers/main_controller.rb

	def list_properties

		if((params[:search][:country]=="") or (params[:search][:checkin]=="") or (params[:search][:checkout]=="") or (params[:search][:guest_count]=="") )
			flash[:notice] = "Enter All the Fields to continue"
	    	redirect_to new_main_path

		else
			@booking= Booking.new
			@search_params = params['search']
			@bval = Hash.new
			@properties = Property.country(params[:search][:country]).checkin(params[:search][:checkin]).checkout(params[:search][:checkout]).guest_count(params[:search][:guest_count])
			@hash = {}
			@properties.each do |prop|
				prop.bookings.each do |booking|
---
SELECT * FROM `properties` WHERE ((((guestcnt > '%1%') AND (ch_out > '%2014-03-29%')) AND (ch_in < '%2014-02-27%')) AND (place like '%india%'))
SELECT * FROM `bookings` WHERE (`bookings`.property_id = 12) AND ((('2019-10-31' < b_cin) AND ('2023-01-01' < b_cin)) OR (('2019-10-31' < b_cout) AND ('2023-01-01' < b_cout)) AND ((b_cin < '2019-10-31') AND ('2023-01-01' < b_cout)))