app/controllers/property_controller.rb

INSERT INTO `properties` (`place`, `r_name`, `r_type`, `ch_in`, `ch_out`, `price`, `guestcnt`, `created_at`, `updated_at`, `user_id`) VALUES('IN', 'Nothing', 'single', '2015-11-01', '2016-03-02', '2000', '3', '2014-02-05 06:32:16', '2014-02-05 06:32:16', 1)
---
	def create
		 @property=current_user.properties.build(params[:property])

	    if( (params[:property][:place]=="") or (params[:property][:r_name]=="") or (params[:property][:r_type]=="") or (params[:property][:ch_in]=="") or (params[:property][:ch_out]=="") or (params[:property][:price]=="") or (params[:property][:guestcnt]==""))
	    	flash[:notice] = "Enter All the Fields to continue"
	    	render :action => :new
	    else
	    	 if @property.save