app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `login`, `crypted_password`, `password_salt`, `email`, `persistence_token`, `single_access_token`, `perishable_token`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`) VALUES('ti.vignesh', 'ti.vignesh', 'b171f1c2f4a1ca55d6ca28c9661e81a3554c0203a2de6023feb8b0d6022f5446ec4ab6ec660bf7ec599e2de8b53eea558b0e322f9e3b40d9fce61dbbaea9521e', '06m44OCS3zfBsbFQNe6G', 'ti.vignesh@gmail.com', '5e8f0a0891a7baef7c1f1a9f078efc3a0b80b068b3ca83a52bea62e84fcb67f8b6698fe6a0532081912ca6aa01ef565bfc12744060438283891a1818122b8e7d', 'n7zRMZ3qfpUhCFIdSX4', 'VdXJJ7YCqy4cLFvrs3n', 1, 0, '2014-01-27 09:21:18', '2014-01-27 09:21:18', NULL, '127.0.0.1', NULL, '2014-01-27 09:21:18', '2014-01-27 09:21:18')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `properties`.* FROM `properties` INNER JOIN `bookings` ON `properties`.id = `bookings`.property_id WHERE ((`bookings`.user_id = 1))
SELECT `users`.* FROM `users` INNER JOIN `bookings` ON `users`.id = `bookings`.user_id WHERE ((`bookings`.property_id = 37))
---
  def my_properties

    @current_user_properties=current_user.property.find(:all, :include => :booked_users)